src/DataProcessors/внНастройкаЖурналаРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>внНастройкаЖурналаРегистрации</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/внРегистрируемыеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>внРегистрируемыеОбъекты</Name>
			<Comment>// Объекты регистрацию которых осуществлять нужно/не нужно</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>МетаданныеОбъекта</Name>
					<Comment>// метаданные объекта строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяТЧ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/внТипОбменаРИБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>внТипОбменаРИБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбменЧерезРИБХранительЖурнала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменКэшемЖурналаЧерезТиповойРИБ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/внТипИБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>внТипИБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Серверная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файловая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/внМетодыРегистрацииНовыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>внМетодыРегистрацииНовыхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФиксироватьВыбранныеОбъектыИНовые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксироватьТолькоВыбранныеОбъекты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИдентификаторыОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыОбъектовМетаданных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокКоллекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Например, "ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Comment>Например, "ПланВидовХарактеристик.ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйСиноним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПустойСсылки</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъектаМетаданных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/внНастройкаЖурналаРегистрации/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ

//
// Процедура выполняет обновление информационной базы в случае необходимости.
//
Процедура ВыполнитьОбновление() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ТекущаяВерсия	= внЖурналРегистрацииПовтИсп.глВНЗначениеПеременной("Версия");
	ПоследняяВерсия = "3.0.6.1";
	
	Если ТекущаяВерсия = ПоследняяВерсия Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущаяВерсия) Тогда
		
		// Это первый запуск
		ЗаполнитьПервоначальнымиДанными();
		
	Иначе
		
		Если ТекущаяВерсия = "3.0.5.0" Тогда
			ОбновитьДоВерсии_3_0_6();
		КонецЕсли;
		
		Сообщить("Подсистема <Журнал регистрации изменений во внешней ИБ 1С> обновлена на версию " + ПоследняяВерсия);
		
	КонецЕсли;
	
	// Если БСП обновим идентификаторы
	Попытка
		Если Метаданные.Справочники.Найти("ИдентификаторыОбъектовМетаданных") <> Неопределено Тогда
			Выполнить("Справочники.ИдентификаторыОбъектовМетаданных.ОбновитьДанныеСправочника()");
		КонецЕсли;
	Исключение		
	КонецПопытки;
	
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("Версия", ПоследняяВерсия);
	ОбновитьПовторноИспользуемыеЗначения();
		
КонецПроцедуры

Процедура ЗаполнитьПервоначальнымиДанными() Экспорт
	
	// Удаляем регистры из регистрируемых объектов
	НаборЗаписей = РегистрыСведений.внРегистрируемыеОбъекты.СоздатьНаборЗаписей();
	Для каждого Регистр Из Метаданные.РегистрыСведений Цикл
		НоваяЗапись						= НаборЗаписей.Добавить();
		НоваяЗапись.МетаданныеОбъекта	= Регистр.ПолноеИмя();
		НоваяЗапись.ИмяТЧ				= "";
		НоваяЗапись.ИмяРеквизита		= "";
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ИспользоватьПараметрУникальностиИБ",	Истина);
	Параметры																								= внЖурналРегистрации.ПараметрУникальностиИБ();
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ПараметрУникальностиСписокСерверов",	Параметры.Сервер);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ПараметрУникальностиИмяБазы",			Параметры.ИмяБазы);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ИдентификаторИБ",						Метаданные.Имя);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ТипОбменаРИБ",							Перечисления.внТипОбменаРИБ.ОбменЧерезРИБХранительЖурнала);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ТипИБ",								Перечисления.внТипИБ.Серверная);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ОткрыватьСобытияСФильтромИзменений",	Истина);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("РазмерПакетаПереносаДанных",			100);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("ДавностьПросмотраВЖурналеПоУмолчанию",	2);
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("МетодРегистрацииОбъектовМетаданных",	Перечисления.внМетодыРегистрацииНовыхОбъектов.ФиксироватьВыбранныеОбъектыИНовые);
	
КонецПроцедуры

Процедура ОбновитьДоВерсии_3_0_6() Экспорт
	
	внЖурналРегистрацииСервер.УстановитьНастройкуЖурналаРегистрации("МетодРегистрацииОбъектовМетаданных",	Перечисления.внМетодыРегистрацииНовыхОбъектов.ФиксироватьВыбранныеОбъектыИНовые);
	
КонецПроцедуры
